# Customer API - Staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/customer/customer-api/infrastructure/workspaces/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/Connectilly/customer-api-staging/runs/run-yrZZ4sWCBG7mSNnL

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.database_user.random_password.password: Refreshing state... [id=none]
module.aws_lambda.data.archive_file.default: Refreshing...
module.database_user.data.aws_ssm_parameter.cluster_id: Refreshing...
module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/lambda-customer-api-staging-customer-api]
data.aws_ssm_parameter.cluster_id: Refreshing...
module.aws_lambda.data.aws_iam_policy_document.default: Refreshing...
module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=h86ahn8llc]
module.aws_lambda.data.aws_iam_policy_document.default: Refresh complete after 0s [id=3693445097]
module.aws_lambda.aws_iam_role.default: Refreshing state... [id=lambda-execution-customer-api-customer-api-staging]
module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-customer-api-customer-api-staging-20230424110012618100000001]
module.aws_lambda.data.archive_file.default: Refresh complete after 2s [id=3727d0ab1eddde8ae448b14b7cbb685c9caeb764]
data.aws_ssm_parameter.cluster_id: Refresh complete after 1s [id=customer-shared-staging-customer-cluster-id]
module.database_user.data.aws_ssm_parameter.cluster_id: Refresh complete after 1s [id=customer-shared-staging-customer-cluster-id]
module.database_user.cockroach_sql_user.default: Refreshing state... [id=aea7ce45-45d0-4f49-8033-aed9c13da58e:customer-api]
module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/api-gateway-customer-api-staging-customer-api]
module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=lambda-customer-api-staging-customer-api]
module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=47d0qo7]
module.aws_api_gateway.aws_apigatewayv2_route.any: Refreshing state... [id=hya6qy4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "customer"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "customer-api"
    }

  # module.aws_lambda.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "lambda-customer-api-staging-customer-api"
        tags                           = {
            "domain"        = "customer"
            "environment"   = "customer-api-staging"
            "resource"      = "customer-api"
            "resource_type" = "lambda"
        }
        # (22 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING" = "postgresql://customer-api:%23YuBC-P&e6oaB%25F-U3&l20e%7D&0%5DpyQY9N%29%3A_8TTsW0%21_qVM3%23%3AU8%298jFCq%7B$j%28M=@customer-shared-staging-customer-4505.6xw.cockroachlabs.cloud:26257/customer?sslmode=verify-full"
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "aea7ce45-45d0-4f49-8033-aed9c13da58e:customer-api"
        name       = "customer-api"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "15e78b4e-f5d3-446b-95c2-427327596891" -> "9b042f10-0aac-4157-8468-7907b67811a6"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ customer_database_connection_string = (sensitive value)

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*